const arRiddles = [
  {
    id: 1,
    question: 'ليس لي فم ولكني أتكلم مع الحكماء. ليس لي عيون ولكني أري الطريق. ما أنا؟',
    answer: 'علامة',
  },
  {
    id: 2,
    question: 'كلما أخذت أكثر، تركت أكثر خلفك. ما أنا؟',
    answer: 'خطوات',
  },
  {
    id: 3,
    question: 'أتحدث بلا فم وأسمع بلا أذنين. ليس لي جسد ولكنني أحيا مع الريح. ما أنا؟',
    answer: 'صدى',
  },
  {
    id: 4,
    question: 'ما له مفاتيح ولكن لا أقفال، ومساحة ولكن لا غرفة، ويمكنك الدخول ولكن لا يمكنك البقاء في الداخل؟',
    answer: 'لوحة مفاتيح',
  },
  {
    id: 5,
    question: 'كلما شاركتني أكثر، زاد ما عندي. ما أنا؟',
    answer: 'علم',
  },
  {
    id: 6,
    question: 'لي رأس وذيل ولكن ليس لي جسد. ما أنا؟',
    answer: 'عملة',
  },
  {
    id: 7,
    question: 'ما الشيء الذي يمكنك الإمساك به ولكن لا يمكنك رميه؟',
    answer: 'برد',
  },
  {
    id: 8,
    question: 'ما الشيء الذي يجب كسره قبل استخدامه؟',
    answer: 'بيضة',
  },
  {
    id: 9,
    question: 'أنا خفيف كالريشة، لكن أقوى شخص لا يستطيع حملّي لأكثر من دقيقة. ما أنا؟',
    answer: 'نفس',
  },
  {
    id: 10,
    question: 'لي مدن ولكن لا بيوت، وغابات ولكن لا أشجار، وماء ولكن لا سمك. ما أنا؟',
    answer: 'خريطة',
  },
]

export default arRiddles
